# CLI tools
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "jq"
brew "nvm"
brew "ripgrep"
brew "starship"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Docker
cask "docker"

# Deployment
brew "flyctl"
cask "google-cloud-sdk"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Terminal
cask "ghostty"
cask "warp"

# Local AI
brew "ollama"

# Notes
cask "obsidian"
