# CLI tools
brew "bat"
brew "eza"
brew "fzf"
brew "gh"
brew "jq"
brew "nvm"
brew "ripgrep"
brew "starship"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Docker
cask "docker"

# Terminal
cask "cmux"
cask "ghostty"
cask "warp"
